In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('data/sales_data.csv')
df.head()

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,26/11/2013,26,November,2013,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
1,26/11/2015,26,November,2015,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
2,23/03/2014,23,March,2014,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,23,45,120,1366,1035,2401
3,23/03/2016,23,March,2016,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,20,45,120,1188,900,2088
4,15/05/2014,15,May,2014,47,Adults (35-64),F,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,4,45,120,238,180,418

In [3]:
df2 = pd.read_csv('data/btc-market-price.csv',
                  header = None, #this is where you make the first row not to be the header
                  na_values = ['','?','-'], #this is where you specify which values are null
                 names = ['Timestamp','Price'], #this is where the column names is been set
                 dtype = {'Price': 'float'})#this is where yo set the data types for the columns
#trying to use the various import parameters to see their performance at import time
#check how to set the column names for this dataframe
df2.head()

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [4]:
df2.dtypes

Timestamp     object
Price        float64
dtype: object

In [5]:
df2['Timestamp'] = pd.to_datetime(df2['Timestamp']) 
#setting the 'Timestamp' column to a datetime value

In [6]:
df2.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [7]:
df2 = pd.read_csv('data/btc-market-price.csv',
                  header = None, #this is where you make the first row not to be the header
                  na_values = ['','?','-'], #this is where you specify which values are null
                 names = ['Timestamp','Price'], #this is where the column names is been set
                 dtype = {'Price': 'float'}) #this is where yo set the data types for the columns
                 #index_col = [0]) # this is where we set the 'Timestamp' as our index column
#trying to use the various import parameters to see their performance at import time
#check how to set the column names for this dataframe
df2.head()

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [8]:
df2.head()

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [9]:
df2['Price'].dtypes

dtype('float64')

In [15]:
df2 = pd.read_csv('data/btc-market-price.csv',
                  header = None, #this is where you make the first row not to be the header
                  na_values = ['','?','-'], #this is where you specify which values are null
                 names = ['Timestamp','Price'], #this is where the column names is been set
                 dtype = {'Price': 'float'}, #this is where yo set the data types for the columns
                index_col = [0]) # this is where we set the 'Timestamp' as our index column
#trying to use the various import parameters to see their performance at import time
#check how to set the column names for this dataframe
df2.head()

                   Price
Timestamp
2/4/17 0:00  1099.169125
3/4/17 0:00  1141.813000
4/4/17 0:00          NaN
5/4/17 0:00  1133.079314
6/4/17 0:00          NaN

In [11]:
df2.dtypes

Price    float64
dtype: object

### TRYING WITH ANOTHER TEXT FILE

In [12]:
exam = pd.read_csv('data/exam_review.csv')
exam
#the output is kind of messy. in the next cell, I tried it in a different way

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

In [13]:
# I used the sep parameter
exam = pd.read_csv('data/exam_review.csv', sep='>') # it means we are telling pandas that '>' is our seperator
exam

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [19]:
exam = pd.read_csv('data/exam_review.csv',
                   sep='>',
                   decimal = ',') #this is to make sure that columns are interpreted using integer values
exam

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [21]:
exam[['age','math_score','french_score']].dtypes

age               int64
math_score      float64
french_score    float64
dtype: object

In [33]:
exam = pd.read_csv('data/exam_review.csv',
                   sep='>',
                   decimal = ',',
                  skiprows = [1,3],) # skiprows can be used to ignore certain rows and choose where you want to start reading the file

exam

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

In [35]:
exam = pd.read_csv('data/exam_review.csv',
                   sep='>',
                   decimal = ',',
                  skip_blank_lines = False) 
# automatically, while reading files, the skip_blank_lines is set to True. setting it to False shows the blank lines present
exam

  first_name last_name   age  math_score  french_score
0        Ray    Morley  18.0        68.0          75.0
1     Melvin     Scott  24.0        77.0          83.0
2     Amirah     Haley  22.0        92.0          67.0
3        NaN       NaN   NaN         NaN           NaN
4     Gerard     Mills  19.0        78.0          72.0
5        Amy    Grimes  23.0        91.0          81.0

In [38]:
exam = pd.read_csv('data/exam_review.csv',
                   sep='>',
                   decimal = ',',
                  usecols = ['first_name', 'last_name','age'])
#the usecols parameter is used to set the number of columns we want to see
#you can also use the column position: [0,1,2] instead of the column names
exam

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [44]:
# if the parsed data only contains one column, we can return series by setting squeeze parameter to True
exam1 = pd.read_csv('data/exam_review.csv',
                   sep = '>',
                   decimal = ',',
                   usecols = ['first_name'],
                   squeeze = True)

exam1

0       Ray
1    Melvin
2    Amirah
3    Gerard
4       Amy
Name: first_name, dtype: object

In [45]:
type(exam1)

pandas.core.series.Series

In [51]:
exam.to_csv('used.csv',
           index = None) #generating a path where our new csv file will be saved

In [53]:
exam

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [52]:
pd.read_csv('used.csv')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

### PARAMETERS COVERED
`sep`, `decimal`, `usecols`, `index_col`, `header`, `na_values`, `skip_blank_lines`, `skiprows`, `dtypes`, `names`